tutorials/thinChannelWithFlucUmean/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-2;

deltaT          5e-4;

writeControl    adjustableRunTime;

writeInterval   5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
"libsyntheticTurbulenceInlet.so"
);

functions
{
  #includeFunc    patchFlowRate(name=inletFlowRate, patch=inlet)
  #includeFunc    patchAverage(name=areaAv_inlet, patch=inlet, fields=(U))
}


// ************************************************************************* //
